TProfileST1/casebase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            uniformNormalFixedValue;
        uniformValue    constant 0.0007;          // 10 INTO the domain

    }
    
    "ES.*"
    {
 	type            zeroGradient;  
    }

    "IS.*"   //"(ES|IS).*"
    {
        type            zeroGradient;        
    }
    walls
    {
        type            noSlip;
    }  
}

// ************************************************************************* //
