TProfileST1/casebase/system/boundingBox
xmin -36.00;
xmax 26.00;
ymin -21.00;
ymax 96.00;
zmin -31.00;
zmax 31.00;
