TProfileST1/casebase/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.1;
    }

    T
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0.0;
    };

}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    consistent      yes;
    momentumPredictor false;
    pRefCell    0;
    pRefValue    0;
    residualControl
    {
        p               1e-5;
        U               1e-5;
        T               1e-5;
    }
}


relaxationFactors
{
    fields
    {
        p              0.7;
    }
    equations
    {
        U               0.95;
        T               0.95;
    }
}


// ************************************************************************* //
